app/views/visits/_form.html.erb

  <div class="">
    <%= form.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>
---
SELECT "categories".* FROM "categories"