app/views/visits/index.html.erb

        <td><%= visit.id %></td>
    <%= if visit.appointment.count != nil %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1 LIMIT $2  [["visit_id", 1], ["LIMIT", 1]]