app/views/visits/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1  [["visit_id", 1]]
SELECT 1 AS one FROM "appointments" WHERE "appointments"."visit_id" = $1 LIMIT $2  [["visit_id", 1], ["LIMIT", 1]]
---

<% if @visit.appointments.exists? %>