app/views/users/_form.html.erb

SELECT "roles".* FROM "roles"
---
    <%= form.label :role_id %>
    <%= collection_select(
      :user, :role_id, Role.all, :id, :name, { prompt: true }
    ) %>

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id %>
    <%= collection_select(
      :user, :category_id, Category.all, :id, :name, { prompt: true }
    ) %>