app/views/users/show.html.erb


<p>Created visits: <strong><%= @user.created_visits.count %></strong> Received appointments: <strong><%= @user.received_appointments.count %></strong> </p>
  <strong>All my visits</strong>
  <% @user.created_visits.each do |cr_vis| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1 ORDER BY "appointments"."id" ASC LIMIT $2  [["visit_id", 1], ["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."doc_id" = $1  [["doc_id", 1]]

  <% end %>
<p>Requested visits: <strong><%= @user.requested_visits.count %></strong>  Received appointments: <strong><%= @user.given_appointments.count %></strong> </p>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1 ORDER BY "appointments"."id" ASC LIMIT $2  [["visit_id", 4], ["LIMIT", 1]]

       <p>Patient`s problem: <%= @visit.problem %></p>
       <p>Given appointment: <%= @visit.appointments.first.recipe %></p>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1 ORDER BY "appointments"."id" ASC LIMIT $2  [["visit_id", 4], ["LIMIT", 1]]