app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)
    @appointment.visit_id = params[:visit_id]
    @appointment.save
---
INSERT INTO "appointments" ("recipe", "visit_id", "created_at", "updated_at", "doc_id", "receiver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe", "O, I am very sorry"], ["visit_id", 2], ["created_at", "2021-12-18 19:01:25.483624"], ["updated_at", "2021-12-18 19:01:25.483624"], ["doc_id", 4], ["receiver_id", 1]]