app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @user = User.new
    @user.category_id = @category.id
    @category_users = @category.users.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "doctor_categories" ON "users"."id" = "doctor_categories"."doc_id" WHERE "doctor_categories"."category_id" = $1  [["category_id", 1]]