app/controllers/roles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role_id" = $1  [["role_id", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."role_id" = $1 LIMIT $2  [["role_id", 1], ["LIMIT", 1]]
---
  def show
    if @role.users.empty?
      @associated_user = 'None'
    else
      @associated_users = @role.users.map(&:name).join(', ')