app/controllers/users_controller.rb

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2, "category_id" = $3 WHERE "users"."id" = $4  [["encrypted_password", "$2a$12$40m/JKTOkl9SlBpP1ncDm.zEjrsD75naBFPzzO6LSouXdyKMLpG0i"], ["updated_at", "2021-12-20 22:27:00.424779"], ["category_id", 1], ["id", 2]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "ddulitl@mail.com"], ["updated_at", "2021-12-19 16:41:54.402273"], ["id", 4]]
---
  def update
    if user_params[:password].blank?
      user_params.delete(:password)
      user_params.delete(:password_confirmation)
    end

    successfully_updated = if needs_password?(@user, user_params)
                             @user.update(user_params)
                           else
                             @user.update_without_password(user_params)