app/controllers/visits_controller.rb

  def index
    @visits = Visit.all
    @appointments = Appointment.all
---
SELECT "visits".* FROM "visits"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1 LIMIT $2  [["visit_id", 1], ["LIMIT", 1]]

  def show
    @creator = @visit.creator
    @doc = @visit.doc
    @appointment = Appointment.new
    @appointment.visit_id = @visit.id
    @appointment.receiver_id = @visit.creator.id
    @appointment = @visit.appointment.first
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."visit_id" = $1  [["visit_id", 1]]

  def create
    @visit = current_user.created_visits.build(visit_params)

    respond_to do |format|
      if @visit.save
---
INSERT INTO "visits" ("date", "time", "problem", "created_at", "updated_at", "creator_id", "doc_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @visit.update(visit_params)
---
UPDATE "visits" SET "problem" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["problem", "Too nervious"], ["updated_at", "2021-12-18 18:27:28.069524"], ["id", 3]]

  def destroy
    @visit.destroy
---
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 5]]

  def set_visit
    @visit = Visit.find(params[:id])
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]