app/views/categories/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "doctor_categories" ON "users"."id" = "doctor_categories"."doc_id" WHERE "doctor_categories"."category_id" = $1  [["category_id", 1]]
---
<ul>All doctors in this category:
  <% @category.users.each do |user| %>