app/views/categories/show.html.erb

SELECT "doctor_categories".* FROM "doctor_categories" WHERE "doctor_categories"."category_id" = $1  [["category_id", 1]]
---
<ul>All doctors in this category:
  <% @category.doctor_categories.each do |doc| %>